# Height Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData..::..Height Property
DuctFittingAndAccessoryConnectorData Class See Also
---
The connector height, Units:(ft).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Height { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Height As Double
	Get
```

Visual C++
---
```text
public:
property double Height {
	double get ();
}
```

# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace